/* SAY  IS THE INSTRUCTION WHICH ALLOWS THE REXX PROGRAM TO SHOW OUTPUT ON 
CONSOLE */

SAY "HELLO"  /* IT WILL PRINT HELLO ON CONSOLE */
SAY "Hello"  /* IT WILL PRINT Hello ON CONSOLE */
SAY HeLLO    /* IT WILL PRINT HELLO ON CONSOLE */
SAY 4 + 9    /* IT WILL PRINT 13 ON CONSOLE */
exit
