/* Just like other laguages rexx supports the IF Else conditions*/
/* Syntax:
IF condition THEN
   statement
ELSE
   statement
*/

IF 1=2 THEN
   SAY '1 is equal to 1'
ELSE
   SAY '1 is not equal to 1'
exit

