/* Simple Do loop allows us to group the statements together*/
/* Syntax:

Do
    statements
End

*/

IF 1 = 1 THEN
    Do
        SAY "this is statement 1"
        SAY "this is statement 1"
        SAY "this is statement 1"
        SAY "this is statement 1"
    End
ELSE
    Do
        SAY "this is statement 2"
        SAY "this is statement 2"
        SAY "this is statement 2"
        SAY "this is statement 2"
    End
EXIT