/* Do While loop in Rexx 
The Do While loop is used to execute a block of code repeatedly as long as a 
condition is true, it check for the condition before executing the block of 
code.
*/
/* Syntax:
do while condition
   statements
end
*/

i=9
do while i < 10
    say i
    i = i + 1
end

