/* Do Until loop in Rexx 
The Do Until loop is used to execute a block of code repeatedly as long as a 
condition becomes, it executes the block of code at least once.
*/
/* Syntax:
do Until condition
   statements
end
*/

i=9
do until i = 10
    say i
    i = i + 1
end

